In [2]:
import pyspark

In [3]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Missing").getOrCreate()

In [4]:
spark

In [49]:
df=spark.read.csv("../data/test2.csv",header=True,inferSchema=True)
df.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|  Alice|  25|         2| 40000|
|    Bob|  30|         5| 50000|
|Charlie|  28|         4|  NULL|
|  David|NULL|         3| 45000|
|    Eva|  35|      NULL| 60000|
|  Frank|  29|         6| 55000|
|  Grace|NULL|      NULL| 42000|
|   Hank|  40|        10| 80000|
|    Ivy|  22|         1|  NULL|
|   Jack|  33|         8| 75000|
|  Karen|  27|      NULL|  NULL|
|    Leo|  31|         7| 67000|
|   Mona|  26|         3| 48000|
|   Nina|  24|         2| 41000|
|  Oscar|NULL|         4| 52000|
|   Paul|  38|         9| 79000|
|  Quinn|  21|      NULL| 39000|
|   Rose|  23|         1| 42000|
|  Steve|  36|        11|  NULL|
|   Tina|NULL|      NULL|  NULL|
+-------+----+----------+------+

In [50]:
df.drop("salary").show()

+-------+----+----------+
|   Name| Age|Experience|
+-------+----+----------+
|  Alice|  25|         2|
|    Bob|  30|         5|
|Charlie|  28|         4|
|  David|NULL|         3|
|    Eva|  35|      NULL|
|  Frank|  29|         6|
|  Grace|NULL|      NULL|
|   Hank|  40|        10|
|    Ivy|  22|         1|
|   Jack|  33|         8|
|  Karen|  27|      NULL|
|    Leo|  31|         7|
|   Mona|  26|         3|
|   Nina|  24|         2|
|  Oscar|NULL|         4|
|   Paul|  38|         9|
|  Quinn|  21|      NULL|
|   Rose|  23|         1|
|  Steve|  36|        11|
|   Tina|NULL|      NULL|
+-------+----+----------+

In [51]:
df.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|  Alice|  25|         2| 40000|
|    Bob|  30|         5| 50000|
|Charlie|  28|         4|  NULL|
|  David|NULL|         3| 45000|
|    Eva|  35|      NULL| 60000|
|  Frank|  29|         6| 55000|
|  Grace|NULL|      NULL| 42000|
|   Hank|  40|        10| 80000|
|    Ivy|  22|         1|  NULL|
|   Jack|  33|         8| 75000|
|  Karen|  27|      NULL|  NULL|
|    Leo|  31|         7| 67000|
|   Mona|  26|         3| 48000|
|   Nina|  24|         2| 41000|
|  Oscar|NULL|         4| 52000|
|   Paul|  38|         9| 79000|
|  Quinn|  21|      NULL| 39000|
|   Rose|  23|         1| 42000|
|  Steve|  36|        11|  NULL|
|   Tina|NULL|      NULL|  NULL|
+-------+----+----------+------+

In [52]:
df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [53]:
df.na.drop().show()

+-----+---+----------+------+
| Name|Age|Experience|Salary|
+-----+---+----------+------+
|Alice| 25|         2| 40000|
|  Bob| 30|         5| 50000|
|Frank| 29|         6| 55000|
| Hank| 40|        10| 80000|
| Jack| 33|         8| 75000|
|  Leo| 31|         7| 67000|
| Mona| 26|         3| 48000|
| Nina| 24|         2| 41000|
| Paul| 38|         9| 79000|
| Rose| 23|         1| 42000|
+-----+---+----------+------+

In "na" function, how parameter can be "all" or "any"

In [54]:
df.na.drop(how="all").show()
print("The count after how is set to all is",df.na.drop(how="all").count(),"is because it drop row olny if all columns are null.")
print("The count after how is set to any is",df.na.drop(how="any").count(),"is because it drop if there is even 1 null value in row.")

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|  Alice|  25|         2| 40000|
|    Bob|  30|         5| 50000|
|Charlie|  28|         4|  NULL|
|  David|NULL|         3| 45000|
|    Eva|  35|      NULL| 60000|
|  Frank|  29|         6| 55000|
|  Grace|NULL|      NULL| 42000|
|   Hank|  40|        10| 80000|
|    Ivy|  22|         1|  NULL|
|   Jack|  33|         8| 75000|
|  Karen|  27|      NULL|  NULL|
|    Leo|  31|         7| 67000|
|   Mona|  26|         3| 48000|
|   Nina|  24|         2| 41000|
|  Oscar|NULL|         4| 52000|
|   Paul|  38|         9| 79000|
|  Quinn|  21|      NULL| 39000|
|   Rose|  23|         1| 42000|
|  Steve|  36|        11|  NULL|
|   Tina|NULL|      NULL|  NULL|
+-------+----+----------+------+

The count after how is set to all is 20 is because it drop row olny if all columns are null.
The count after how is set to any is 10 is because it drop if there is even 1 null value in row.

**Tweaking with Threshold value** <br>
(after applying thresh parameter, the "how is ignored")

In [55]:
df.na.drop(thresh=0).show()
print("Threshhold value: 0,Row count:",df.na.drop(thresh=0).count(),"because there are",df.na.drop(thresh=0).count(),"rows with atleast 0 Non-Null values.")
print("Threshhold value: 1,Row count:",df.na.drop(thresh=1).count(),"because there are",df.na.drop(thresh=1).count(),"rows with atleast 1 Non-Null values.")
print("Threshhold value: 2,Row count:",df.na.drop(thresh=2).count(),"because there are",df.na.drop(thresh=2).count(),"rows with atleast 2 Non-Null values.")
print("Threshhold value: 3,Row count:",df.na.drop(thresh=3).count(),"because there are",df.na.drop(thresh=3).count(),"rows with atleast 3 Non-Null values.")

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|  Alice|  25|         2| 40000|
|    Bob|  30|         5| 50000|
|Charlie|  28|         4|  NULL|
|  David|NULL|         3| 45000|
|    Eva|  35|      NULL| 60000|
|  Frank|  29|         6| 55000|
|  Grace|NULL|      NULL| 42000|
|   Hank|  40|        10| 80000|
|    Ivy|  22|         1|  NULL|
|   Jack|  33|         8| 75000|
|  Karen|  27|      NULL|  NULL|
|    Leo|  31|         7| 67000|
|   Mona|  26|         3| 48000|
|   Nina|  24|         2| 41000|
|  Oscar|NULL|         4| 52000|
|   Paul|  38|         9| 79000|
|  Quinn|  21|      NULL| 39000|
|   Rose|  23|         1| 42000|
|  Steve|  36|        11|  NULL|
|   Tina|NULL|      NULL|  NULL|
+-------+----+----------+------+

Threshhold value: 0,Row count: 20 because there are 20 rows with atleast 0 Non-Null values.
Threshhold value: 1,Row count: 20 because there are 20 rows with atleast 1 Non-Null values.
Threshhold value: 2,Row count: 19 because there are 19 rows with atleast 2 Non-Null values.
Threshhold value: 3,Row count: 17 because there are 17 rows with atleast 3 Non-Null values.

Subset : it'll remove rows if there are any null values in provided columns in subset.

In [56]:
df.na.drop(subset=["age","salary"]).show()

+-----+---+----------+------+
| Name|Age|Experience|Salary|
+-----+---+----------+------+
|Alice| 25|         2| 40000|
|  Bob| 30|         5| 50000|
|  Eva| 35|      NULL| 60000|
|Frank| 29|         6| 55000|
| Hank| 40|        10| 80000|
| Jack| 33|         8| 75000|
|  Leo| 31|         7| 67000|
| Mona| 26|         3| 48000|
| Nina| 24|         2| 41000|
| Paul| 38|         9| 79000|
|Quinn| 21|      NULL| 39000|
| Rose| 23|         1| 42000|
+-----+---+----------+------+

Filling the null values:

In [57]:
df.na.fill({"Experience": 0, "Salary": 2000}).show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|  Alice|  25|         2| 40000|
|    Bob|  30|         5| 50000|
|Charlie|  28|         4|  2000|
|  David|NULL|         3| 45000|
|    Eva|  35|         0| 60000|
|  Frank|  29|         6| 55000|
|  Grace|NULL|         0| 42000|
|   Hank|  40|        10| 80000|
|    Ivy|  22|         1|  2000|
|   Jack|  33|         8| 75000|
|  Karen|  27|         0|  2000|
|    Leo|  31|         7| 67000|
|   Mona|  26|         3| 48000|
|   Nina|  24|         2| 41000|
|  Oscar|NULL|         4| 52000|
|   Paul|  38|         9| 79000|
|  Quinn|  21|         0| 39000|
|   Rose|  23|         1| 42000|
|  Steve|  36|        11|  2000|
|   Tina|NULL|         0|  2000|
+-------+----+----------+------+

Filling Values using **Imputer**

In [58]:
from pyspark.ml.feature import Imputer
imputer_mean = Imputer(
    inputCols=["Age","Experience"],
    outputCols=["Age_Imputed","Ex_Imput"]
).setStrategy("mean")

Using Mean

In [59]:
imputer_mean.fit(df).transform(df).show()

+-------+----+----------+------+-----------+--------+
|   Name| Age|Experience|Salary|Age_Imputed|Ex_Imput|
+-------+----+----------+------+-----------+--------+
|  Alice|  25|         2| 40000|         25|       2|
|    Bob|  30|         5| 50000|         30|       5|
|Charlie|  28|         4|  NULL|         28|       4|
|  David|NULL|         3| 45000|         29|       3|
|    Eva|  35|      NULL| 60000|         35|       5|
|  Frank|  29|         6| 55000|         29|       6|
|  Grace|NULL|      NULL| 42000|         29|       5|
|   Hank|  40|        10| 80000|         40|      10|
|    Ivy|  22|         1|  NULL|         22|       1|
|   Jack|  33|         8| 75000|         33|       8|
|  Karen|  27|      NULL|  NULL|         27|       5|
|    Leo|  31|         7| 67000|         31|       7|
|   Mona|  26|         3| 48000|         26|       3|
|   Nina|  24|         2| 41000|         24|       2|
|  Oscar|NULL|         4| 52000|         29|       4|
|   Paul|  38|         9| 79000|         38|       9|
|  Quinn|  21|      NULL| 39000|         21|       5|
|   Rose|  23|         1| 42000|         23|       1|
|  Steve|  36|        11|  NULL|         36|      11|
|   Tina|NULL|      NULL|  NULL|         29|       5|
+-------+----+----------+------+-----------+--------+

Using Mode

In [60]:
imputer_mode = Imputer(
    inputCols=["Age","Experience"],
    outputCols=["Age_Imputed","Ex_Imput"]
).setStrategy("mode")

imputer_mode.fit(df).transform(df).show()

+-------+----+----------+------+-----------+--------+
|   Name| Age|Experience|Salary|Age_Imputed|Ex_Imput|
+-------+----+----------+------+-----------+--------+
|  Alice|  25|         2| 40000|         25|       2|
|    Bob|  30|         5| 50000|         30|       5|
|Charlie|  28|         4|  NULL|         28|       4|
|  David|NULL|         3| 45000|         21|       3|
|    Eva|  35|      NULL| 60000|         35|       1|
|  Frank|  29|         6| 55000|         29|       6|
|  Grace|NULL|      NULL| 42000|         21|       1|
|   Hank|  40|        10| 80000|         40|      10|
|    Ivy|  22|         1|  NULL|         22|       1|
|   Jack|  33|         8| 75000|         33|       8|
|  Karen|  27|      NULL|  NULL|         27|       1|
|    Leo|  31|         7| 67000|         31|       7|
|   Mona|  26|         3| 48000|         26|       3|
|   Nina|  24|         2| 41000|         24|       2|
|  Oscar|NULL|         4| 52000|         21|       4|
|   Paul|  38|         9| 79000|         38|       9|
|  Quinn|  21|      NULL| 39000|         21|       1|
|   Rose|  23|         1| 42000|         23|       1|
|  Steve|  36|        11|  NULL|         36|      11|
|   Tina|NULL|      NULL|  NULL|         21|       1|
+-------+----+----------+------+-----------+--------+

Using Median

In [61]:
imputer_median = Imputer(
    inputCols=["Age","Experience"],
    outputCols=["Age_Imputed","Ex_Imput"]
).setStrategy("median")

imputer_median.fit(df).transform(df).show()

+-------+----+----------+------+-----------+--------+
|   Name| Age|Experience|Salary|Age_Imputed|Ex_Imput|
+-------+----+----------+------+-----------+--------+
|  Alice|  25|         2| 40000|         25|       2|
|    Bob|  30|         5| 50000|         30|       5|
|Charlie|  28|         4|  NULL|         28|       4|
|  David|NULL|         3| 45000|         28|       3|
|    Eva|  35|      NULL| 60000|         35|       4|
|  Frank|  29|         6| 55000|         29|       6|
|  Grace|NULL|      NULL| 42000|         28|       4|
|   Hank|  40|        10| 80000|         40|      10|
|    Ivy|  22|         1|  NULL|         22|       1|
|   Jack|  33|         8| 75000|         33|       8|
|  Karen|  27|      NULL|  NULL|         27|       4|
|    Leo|  31|         7| 67000|         31|       7|
|   Mona|  26|         3| 48000|         26|       3|
|   Nina|  24|         2| 41000|         24|       2|
|  Oscar|NULL|         4| 52000|         28|       4|
|   Paul|  38|         9| 79000|         38|       9|
|  Quinn|  21|      NULL| 39000|         21|       4|
|   Rose|  23|         1| 42000|         23|       1|
|  Steve|  36|        11|  NULL|         36|      11|
|   Tina|NULL|      NULL|  NULL|         28|       4|
+-------+----+----------+------+-----------+--------+

In [62]:
spark.stop()